Repository: bassamasfur/app-salud
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: BMI Calculator
es: Calculadora IMC

# subtitle
source: Body Mass Index
es: Índice de Masa Corporal

# whatIsImcTitle
source: What is BMI?
es: ¿Qué es el IMC?

# whatIsImcDesc
source: Body Mass Index is a measure that relates your weight and height to determine if you have a healthy weight.
es: El Índice de Masa Corporal es una medida que relaciona tu peso y altura para determinar si tienes un peso saludable.

# imcRanges
source: BMI Ranges:
es: Rangos de IMC:

source: Underweight
es: Bajo peso

source: Overweight
es: Sobrepeso

source: Obesity
es: Obesidad

# calculateImc
source: Calculate my BMI
es: Calcular mi IMC

# developedBy
source: Developed by Bassam Asfur
es: Desarrollado por Bassam Asfur

source: Personal Data
es: Datos Personales

source: Enter your data
es: Ingresa tus datos

# completeInfoToCalculateImc
source: Complete the information to calculate your BMI
es: Completa la información para calcular tu IMC

# enterHeightHint
source: Enter your height in meters (e.g., 1.75)
es: Ingresa tu altura en metros (ej: 1.75)

source: Name
es: Nombre

source: Enter your name
es: Ingresa tu nombre

# weight
source: Weight (kg)
es: Peso (kg)

# weightHint
source: E.g.: 70.5
es: Ej: 70.5

# height
source: Height (m)
es: Altura (m)

# heightHint
source: E.g.: 1.75
es: Ej: 1.75

# resultTitle
source: BMI Result
es: Resultado IMC

source: New calculation
es: Nuevo cálculo

source: INTERPRETATION
es: INTERPRETACIÓN

source: Recommendations
es: Recomendaciones

# greeting
source: Hello, {name}!
es: ¡Hola, {name}!

# evaluationResults
source: Your evaluation results
es: Resultados de tu evaluación

# yourImcIs
source: Your BMI is:
es: Tu IMC es:

# weightWithUnit
source: Weight: {weight} kg
es: Peso: {weight} kg

# heightWithUnit
source: Height: {height} m
es: Altura: {height} m

# descUnderweight
source: Your weight is below the healthy range. It is recommended to consult a health professional.
es: Tu peso está por debajo del rango saludable. Es recomendable consultar con un profesional de la salud.

# descNormal
source: Congratulations! Your weight is within the healthy range. Keep up your good habits.
es: ¡Felicidades! Tu peso está dentro del rango saludable. Mantén tus buenos hábitos.

# descOverweight
source: Your weight is slightly above the healthy range. Consider making some lifestyle adjustments.
es: Tu peso está ligeramente por encima del rango saludable. Considera hacer algunos ajustes en tu estilo de vida.

# descObesity
source: Your weight is significantly above the healthy range. It is important to seek professional help.
es: Tu peso está significativamente por encima del rango saludable. Es importante buscar ayuda profesional.

# descDefault
source: Consult a health professional for more information.
es: Consulta con un profesional de la salud para más información.

# recommendationsUnderweight
source: Consult a nutritionist for an appropriate meal plan|Include foods rich in protein and healthy fats|Consider strength training to gain muscle mass|Avoid excessive stress that can affect your appetite
es: Consulta con un nutricionista para un plan de alimentación adecuado|Incluye alimentos ricos en proteínas y grasas saludables|Considera hacer ejercicio de fuerza para ganar masa muscular|Evita el estrés excesivo que puede afectar tu apetito

# recommendationsNormal
source: Maintain a balanced diet rich in fruits and vegetables|Exercise regularly (at least 150 min/week)|Keep a regular meal schedule|Stay hydrated (8 glasses of water a day)
es: Mantén una dieta equilibrada rica en frutas y verduras|Realiza actividad física regular (al menos 150 min/semana)|Mantén un horario regular de comidas|Hidrátate adecuadamente (8 vasos de agua al día)

# recommendationsOverweight
source: Gradually reduce food portions|Increase fiber and lean protein intake|Do regular cardiovascular exercise|Limit processed foods and sugary drinks
es: Reduce las porciones de comida gradualmente|Incrementa el consumo de fibra y proteínas magras|Realiza ejercicio cardiovascular regularmente|Limita alimentos procesados y bebidas azucaradas

# recommendationsObesity
source: Consult a doctor for a safe weight loss plan|Consider working with a professional nutritionist|Start with low-intensity exercise and increase gradually|Seek emotional support if necessary
es: Consulta con un médico para un plan de pérdida de peso seguro|Considera trabajar con un nutricionista profesional|Inicia con ejercicio de baja intensidad y aumenta gradualmente|Busca apoyo emocional si es necesario

# recommendationsDefault
source: Consult a health professional for more information.
es: Consulta con un profesional de la salud para más información.

# calculateAnotherImc
source: Calculate another BMI
es: Calcular otro IMC

source: View Report
es: Ver Informe

# viewReportCancel
source: Cancel
es: Cancelar

# viewReportSend
source: Send Report
es: Enviar Informe

source: Back to Home
es: Volver al inicio

# pdfTitle
source: BODY MASS INDEX (BMI) REPORT
es: INFORME DE ÍNDICE DE MASA CORPORAL (IMC)

# pdfPatientInfo
source: PATIENT INFORMATION
es: INFORMACIÓN DEL PACIENTE

# pdfResult
source: BMI RESULT
es: RESULTADO DEL IMC

# pdfReferenceTable
source: BMI Reference Table
es: Tabla de Referencia IMC

# pdfDate
source: Date: {date}
es: Fecha: {date}

source: Category
es: Categoría

source: Generating preview...
es: Generando vista previa...
